{
  "strong_candidate": {
    "email": "sarah.johnson@email.com",
    "documents": {
      "transcript": "Student: Sarah Johnson\nGPA: 3.9 / 4.0\nSubjects: Mathematics (A+), Physics (A), Computer Science (A+), Chemistry (A), English (A)\nAwards: National Merit Scholar, Regional Math Olympiad Gold Medal\nActivities: Robotics Team Captain, Computer Science Club President\nGraduation: June 2025",
      "recommendation": "To the Admissions Committee,\n\nI have had the privilege of teaching Sarah Johnson for two years in Advanced Computer Science and AP Calculus.\n\nSarah is an exceptional student who consistently demonstrates:\n- Outstanding analytical and problem-solving abilities, ranking top 1% of her class\n- Natural leadership qualities - founded and successfully led our school's first AI research club with 30+ members\n- Published research on neural networks in the high school science journal\n- Genuine intellectual curiosity that extends well beyond curriculum requirements\n\nIn my 15 years of teaching, Sarah represents the caliber of student who not only excels academically but also inspires her peers. She has the drive, intelligence, and character to thrive in your rigorous academic environment.\n\nI give Sarah my highest recommendation without any reservation.\n\nSincerely,\nDr. Michael Chen\nComputer Science Department Head\nLincoln High School",
      "essay": "My Journey into Computer Science\n\nEver since I built my first website at age 14, I knew I wanted to pursue computer science. What started as a simple HTML page for my school project evolved into a passion for understanding how technology shapes our world.\n\nThe ability to create solutions that impact millions of people fascinates me. During high school, I led our school's coding club and organized three successful hackathons, bringing together over 100 students. Through these experiences, I learned that computer science is not just about writing code—it's about solving real problems and building communities.\n\nI'm particularly interested in artificial intelligence and its potential to solve pressing societal challenges. Last summer, I interned at a local startup where I worked on a machine learning model to predict equipment failures in hospitals, potentially saving lives and resources. Seeing my code make a tangible difference solidified my commitment to this field.\n\nYour university's research in agentic AI and human-computer interaction aligns perfectly with my goals. I'm excited to contribute to groundbreaking research while learning from world-class faculty and collaborating with talented peers. I'm ready to take on the challenges ahead and make meaningful contributions to the field of computer science."
    }
  },
  "borderline_candidate": {
    "email": "alex.rivera@email.com",
    "documents": {
      "transcript": "Student: Alex Rivera\nGPA: 3.1 / 4.0\nSubjects: Mathematics (B+), Physics (B), Computer Science (B+), Chemistry (C+), English (B)\nActivities: Programming Club Member, Volunteer Tutor\nGraduation: June 2025\nNotes: Showed significant improvement in senior year with 3.6 GPA in final semester",
      "recommendation": "To the Admissions Committee,\n\nI have taught Alex Rivera in Introduction to Computer Science and Data Structures over the past year and a half.\n\nAlex is a dedicated student who demonstrates:\n- Solid understanding of programming fundamentals and consistent effort in coursework\n- Good work ethic and willingness to seek help when facing challenges\n- Improvement over time, showing growth mindset and perseverance\n\nWhile Alex may not be at the top of the class, he shows genuine interest in computer science and has made notable progress throughout his academic career. With the right support and continued dedication, I believe he has the potential to succeed in your program.\n\nI recommend Alex for admission to your computer science program.\n\nSincerely,\nProf. Jennifer Martinez\nComputer Science Department\nLincoln High School",
      "essay": "My Path to Computer Science\n\nI first got interested in computer science when I took an intro class in my junior year. Although I struggled at first with programming concepts, I found the challenge exciting and kept working at it.\n\nWhat I like most about computer science is the problem-solving aspect. I enjoy figuring out how to break down big problems into smaller parts. In my senior year, I joined the programming club and worked on a project to create a simple game, which taught me a lot about teamwork and coding.\n\nI know I have room to improve, and that's why I'm excited about the opportunity to study at your university. I'm particularly interested in software development and want to learn more about building applications that people can use.\n\nI'm ready to work hard and make the most of the education your university offers. I believe with dedication and the right guidance, I can become a successful computer scientist."
    }
  }
}
